import logo from "./logo.svg";
import "./App.css";
import "bootstrap/dist/css/bootstrap.min.css";
import { Navbar, Nav, Container, NavDropdown } from "react-bootstrap";
import { BrowserRouter, Switch, Route, Link ,Routes} from "react-router-dom";
import CharDetails from "./CharDetails";
import Home from "./Home";
function App() {
  const characters = [
    {
      name: "أمجد",
      img: "https://pbs.twimg.com/media/EScj838XsAIw4re?format=png&name=900x900",
      avatarImg:
        "https://images.withthewill.net/adventure2020characterart02_march5_2020.png",
      details:
        "تايتشي المعروف في الدبلجة العربيّة بـأمجد (باليابانية:八神 太一) (بالروماجي:Taichi Yagami)، هُو فتى في الصف الخامس يبلغ من العمر إحدى عشر عاماً وهو الشخصية الرئيسية في المُسلسل، كما أنه الشقيق الأكبر لهيكاري (هند) أحد أبطال الديجيتال الثمانيّة، يُعتبر تايتشي قائداً للمجموعة بسبَب علاقاته المتينة ومحبته مع الجميع وشجاعته في اتخاذ القرارات، على الرّغم من طيّشه وتهوّره إلا أن المجموعة ليس بمقدورها فِعلَ شيءٍ من دونه وظهر ذلك جلياً حينما سحبه تيارٌ نابعٌ من بُعدٍ رقمي إلى العالم الحقيقي في الحلقة 20 (تطور المستوى المثالي! ميتال قريمون)؛ حين افترقت المجموعة بعد أن غاب عنهم لفترة دامت أكثر من شهر وفوّرَ عودته قام بِلَم شتات المجموعة، عنيدٌ أحياناً ولا يُبالي بالخطر الذي قد يُصيبه نتيجةَ قراراته الطائشة، وعلى الرغم من ذلك، فإن تايتشي طيّب الأخلاق ومُتعاون واجتماعي وكذلك حنونٌ مع الجميع خاصةً شقيقته هند، كما يملك أمجد روحاً مرحة وفُكاهيّة حتى في المواقف الصعبة التي تتطلب الجديّة في الكثير من الأحيان، وبصرف النظر عن كونه قائدً لمجموعة أبطال الديجيتال فإن تايتشي بارعٌ في كرة القدم في مدرسته وكان نجمَ فريقه في أحد أندية كرة القدم للمدارس، شكَّل تايتشي ثُنائياً مرحاً مع أقومون (رعد) وخاضا الكثير من المعارك لوحدهِما حيث يُعتبران أفضل ثنائي بين بطل الديجيتال وشريكه، يَملك تايتشي شارة الشجاعة في قلادته التيّ توهجت بفضل شجاعته في مروره في التيّار الكهربائي في هرم شبكة إيتيمون (قردون).",
      id: "1",
    },
    {
      name: "هند",
      img: "https://pbs.twimg.com/media/EScj-PaWkAQnKuA?format=png&name=small",
      avatarImg:
        "https://images.withthewill.net/adventure2020characterart16_march5_2020.png",
      details:
        "هيكاري (باليابانية:八神 ヒカリ ) (بالروماجي:Yagami Hikari)، المعروف في الدبلجة العربية بـهند هي فتاة يابانية تبلغ من العُمر 8 أعوام وتدرس في الصف الثاني، وهي الشقيقة الصُغرى لتايتشي (أمجد) أحد أبطال الديجيتال وتعتبره مثالاً ومصدر إلهام لها، عاشت فترةً من حياتها في هيكاريغاوكا قبل أن تنتقل مع أسرتها إلى مدينة أودايبا، الاسم هيكاري يعني الضوء، وهو نفس اسم مفتاح قلادتها، هيكاري رقيقة للغايّة وهادئة، ومُنذ صغرها وهي عُرضةٌ للأمراض الحساسة، هيكاري لديّها طاقةٌ خاصة تنتج عن طريق النور، وظهر واضحاً في كثير من الأحيان، هيكاري فتاةٌ لطيفة للغاية، ومهذبة وخلوقة، كما أنها في غاية الهدوء، ونادر جداً ما تغضب، وهي فتاة عاطفيّة ورحيمة جداً ولا تستحمل أي صورة من صور التدمير، تُحب الاعتناء بالحيوانات والمخلوقات الرقمية، وتعطف على الضعفاء والصغار، وتُحب الخير وتكره الشر وعواقبه، رُغم وأن لها قلباً عاطفياً فإنها تغضب عندما ترى أي صورةٍ من صوّر الظُلم أو الغرور والتسلط على حساب الضُعفاء، كما أنها كريمةٌ للغايّة وتحب إسعاد غيرها على حساب نفسها، ومتواضعة للغايّة وخلوقة وتُحب المزاح والضحك ولكن بشكلٍ أقل من أخيها، تُربي في منزلها قطة تُسميها ميكو (بيسو في الدبلجة العربية)، تربطها مع مُرافقتها علاقةٌ حميميّة وعميقة، وتحمل شارة النور في قلادتها.",
      id: "2",
    },
    {
      name: "يامن",
      img: "https://pbs.twimg.com/media/EScj9FmWoAMJOC_?format=png&name=900x900",
      avatarImg:
        "https://images.withthewill.net/adventure2020characterart04_march5_2020.png",
      details:
        "ياماتو (باليابانية:石田 ヤマト) (بالروماجي:Ishida Yamato)، المعروف في الدبلجة العربية بـيامن هو فتى في الصف الخامس يبلغُ من العمر إحدى عشرَ عاماً، وهو الشقيق الأكبر لتاكيرو (وسيم) أحد أبطال الديجيتال الثمانية، يعيش ياماتو مع والده في مدينة أودايبا بعد طلاق والديّه، هذا الأمر جعل علاقته مع والدته غيّر مُستقرة بسبب بُعدِه عنها، يُعَد ياماتو أكثر الأولاد جديّةً وعصبيّة؛ فهو سريع الغضب وهادئٌ كثيراً وبارد الأعصاب، ويُنظر إليه على أنه الفتى المتمرد أو الذئب الوحيد الذي يُفضل أن يتعامل مع الأشياء بطريقته الخاصة، مُنعزل ويحب الجلوس بمُفرده في كثير من الأوقات ويهوى العزف في آلتهُ الموسيقية الصغيرة الهارمونيكا كتعبير عن مشاعره، ياماتو هو شخصٌ وُقائي جداً ويخشى على نفسه وعلى الآخرين من مخاطر العالم الرقمي لذلك فإنه كثير الشجار مع تايتشي (أمجد) بسبب تهوّر الأخير في قراراته، يُعتبر ياماتو قائداً ثانوياً للمجموعة بعد تايتشي، على الرّغم من أن ياماتو فتى هادئ وكثير الغضب إلا أنه يملك جانباً حساساً؛ فهو مُحب للجميع ويحرص على مصلحتهم ودفعِ الضرر عنهم، وكثيراً ما يخاف على أخيه تاكيرو ويهتم به اهتماما بالغاً، يُعاب على ياماتو بأنه مُتسرع في الحكم على الآخرين وهذا سبب مُشاجراته الكثيرة، يحمل ياماتو شارة الصداقة في قلادته، على الرّغم من أن ياماتو لا تظهر عليه معاني الصداقة في ظَاهره لكنهُ يحمل معانيها في قلبه خاصةً بعد التجارب التي مرَّ بها في العالم الرقمي.",
      id: "3",
    },
    {
      name: "وسيم",
      img: "https://pbs.twimg.com/media/EScj-FnWsAAS4gj?format=png&name=small",
      avatarImg:
        "https://images.withthewill.net/adventure2020characterart14_march5_2020.png",
      details:
        "     هو فتى ياباني يبلغ من العُمر 8 أعوام ويدرس في الصف الثاني، ,وهو الشقيق الأصغر لياماتو (يامن) أحد أبطال الديجيتال ويعتبره قدوته في الحياة ومثله الأعلى، عاش تاكيرو خارج مدينة أودايبا مع والدته بعد أن حصل الطلاق بين والديّه، واضطر أن يعيش بعيداً عن شقيقه ياماتو ووالده، يُعد تاكيرو أصغر الأولاد سناً، ورغم ذلك فإنه ناضج ولديه عقلٌ واعي ومتفهم، كما أن بالإمكان الاعتماد عليّه بالرغم من صغر سنّه، له شخصيّة مرحة ومٌتفائلة، ويُعتبر شخص ودود ومُحب للجميع، كما أن شخصيته قويّة جداً، دائماً ما يحاول أن يُثبت للجميع أن بإمكانه تخطي الأزمات وحَلْ العُقد، وأثبت ذلك فعلاً في عدة أمور، يكره أن يُنظر إليه على أنه طفلٌ صغير بحاجة إلى المُساعدة، وكثيراً ما كان يُعاتب أخاه على اهتمامه المُبالغ فيه، في بدايّة الأمر كان تاكيرو كثير البُكاء ولكن بعد أن عاش تجارب العالم الرقميّ واجتاز المخاطر والصعوبات أصبحت نفسيّته أقوى من السابق، كان تاكيرو في كثير من الأحيان مُعجب بشخصيّة وشجاعة تايتشي (أمجد) ودائماً ما يستلهم منه أفعاله، يُعتبر وسيم شخصيّة محبوبةً للغايّة من قِبل الجميع، كما أنه يحظى باحترام وتشجيع دائم من الآخرين، وله علاقة حميميّة مع مُرافقه، يملك مفتاح الأمل في قلادته.",
      id: "4",
    },
    {
      name: "مي",
      img: "https://pbs.twimg.com/media/EScj9sFXcAAdv-O?format=png&name=900x900",
      avatarImg:
        "https://images.withthewill.net/adventure2020characterart10_march5_2020.png",
      details:
        "مي المعروفة في الإصدار الياباني بـميمي (باليابانية:太刀川 ミミ) (بالروماجي:Tachikawa Mimi)، هي فتاةٌ يابانيّة تبلغُ من العمر عشرةَ أعوام تدرس في الصف الرابع تعيش في مدينة أودايبا ترتدي ثوباً أحمر وقبعة ورديّة ولها شعرٌ بُني فاتح وبشرةٍ بيضاء وطول فوق المُعدل بالنسبة لعمرها، ميمي دائماً ما كانت تتذمر من وجودها في العالم الرقمي حيث أنها تكره مناظر القتال والصراعات ودائماً ما كانت تتمنى أن تعود إلى بيتها، أبلغ ما يكون وصفها بأنها فتاةٌ أنثوية فهي حساسةٌ جداً وقلبها رهيف وتعتبر فتاةٌ ناعمة مثل بقيّة الفتيات، تهوى مي تصاميم الأزياء وكل ما يُواكب الموضة وتُحب اللون الوردي تحديداً. ورثت ميمي هذه الصفات من والدتها التي تملك ذات الطبع والصفات. تُعتبر ميمي فتاة مُدللة جداً عند والديّها وتعيش حياة مُرفهّة معهما لكونها الابنة الوحيدةِ لهما، تتصرف ميمي بشكلٍ أناني في بعض الأحيان كما حدث في قلعة الحاكم النائم حينما استغلت حاجة المخلوقات الرقمية ونصبت نفسها حاكمة عليهم، وفوق هذا قامت بأسر صديقيّها تايتشي وجو ولكنها تداركت ما كانت تفعله وقامت بالاعتذار لهم جميعاً، ومع هذا فإن ميمي تملك قلباً صافياً ونقياً وكانت دائماً ما تهتم بالجرحى والضعفاء من المخلوقات الرقميّة، وفي الجانب الآخر فإن ميمي تملك موهبةً في الغناء لما تملكه من صوتٍ نادر وعذب، ولديها ذوق غريب في الأطعمة فهي تحب طبق فول الصويا المخمر. تربط ميمي علاقةً وثيقة جداً مع مُرافقتها بالمون (زهرة) فهما أكثر ثنائي عاطفةً اتجاه بعضهما من بقية الأولاد. تملك ميمي صفة الصفاء في مفتاح قلادتها.",
      id: "5",
    },
    {
      name: "شادي",
      img: "https://pbs.twimg.com/media/EScj9ahWkAUch1z?format=png&name=small",
      avatarImg:
        "https://images.withthewill.net/adventure2020characterart08_march5_2020.png",
      details:
        "شادي المعروف في الإصدار الياباني بـكوشيرو (باليابانية:泉 光子郎) (بالروماجي:Izumi Kōshirō)، هو فتى ياباني يبلغُ من العمر عشرةَ أعوام يدرس في الصف الرابع من المرحلة الابتدائية، كوشيرو فتى عبقري جداً وخبير في الأمور التِقنيّة والتكنولوجيّا ومجالات الحاسوب، يستعمل بشكلٍ دائم حاسوبه المحمُول وكان له الفضل في حل الكثير من ألغاز وأسرار العالم الرقميّ أثناء مُغامرة الأولاد فيه، كوشيرو لا يتخلى عن حاسوبه ويقضي الكثير من الوقت بتصفُحه حيث أنه يحمله معه باستمرار أينما ذَهب (سواءً في العالم الرقمي أو عالم الواقع) ويَعدُه أثمن شيءٍ يملكه، يهوى كوشيرو العِلم في جميع المجَالات كما أنه فُضولي العلم بشكل ملحُوظ وما إن يَجد رمزاً غريباً إلا وحاول أن يفك شفرته، اعتمد الأولاد عليه في إخراجهم من الأزمات في كثير من الأوقات الصعبة وخصوصاً أثناء مُحاولتهم فتح الباب المُؤدي إلى العالم الحقيقي من خلال توزيع الأوراق في الطاولةِ الحجريّة حيث ساهم في كِشفْ ثمانيةُ أوراق من أصل تسعة، تُوفي والديه في صِغره بسبب حادث سيرٍ مروري وتبناه زوجين آخرين من أقرباء والده (عمه وزوجته في الدبلجة العربية)، كوشيرو هادئ الأطباع ومُطيع ومُتعاون مع أصدقائه وعائلته ويملك شخصيّةً مُهذبة إضافةً إلى أنه خجول بعض الشيء اجتماعياً، يملك كوشيرو صفة المعرفة في شارة قلادته بسبب حبه للمعرفة وفُضوله العلمي.",
      id: "6",
    },

    {
      name: "زين",
      img: "https://pbs.twimg.com/media/EScj94NX0AEyMip?format=png&name=900x900",
      avatarImg:
        "https://images.withthewill.net/adventure2020characterart12_march5_2020.png",
      details:
        "زين المعروف بالإصدار الياباني بـجو (باليابانية: 城戸 丈 بالروماجي: Kido Jō)، هو فتى ياباني يبلغ من العُمر إثنا عشر عاماً يدرس في الصف السادس، يعيش مع شقيقه في مدينة أودايبا، بينما شقيقه الآخر يعمل في مدينة كيوتو وكلاهما أطباء، ويسعى جو لأن يسلك خُطى شقيقيّه ويُصبح طبيباً في المُستقبل، فهو مُجد في دراسته ودائماً ما يقضي جُل وقته لدراسة الاختبارات، يُعتبر جو أكبر الأولاد سناً وأكثرهم حرصاً عليهم من المخاطر، ولطالما كان جو يُحاول حل المشاكل التي تدور بين الأولاد حيث يعتبر نفسه مسؤولاً عن الأولاد لكونه أكبرهم سناً، شخصية جو تبدو مهزوزةٌ بعض الشيء وغير مُستقرة وكثير الارتباك في المواقف الصعبة والعاديّة في بعض الأحيان، فعلى الرغم من أنه أكبر الأولاد سناً إلا أنه أكثرهم خوفاً وجُبناً، في البداية جو يفتقد إلى الشجاعة ومواجهة الأخطار بشكلٍ أكثر صرامة حيث يكون مذعوراً بشكل دائم لكنه يُحاول أن يُثبت لنفسه والآخرين عكس ذلك، فهو يُعد أكثر الأولاد حكمةً وصبراً ويندر ما يتشاجر مع الآخرين، إضافةً إلى هذا فإن جو أكثر الأولاد إخلاصاً ومصداقيّة، فهو يُبدي سلامة الآخرين على سلامته حيث أنه ضحى بنفسه أكثر من ثلاث مرات أنقذ فيها حياة الأولاد من المخاطر، إضافةً إلى أن جو يُعد شخصاً ذكياً لما يملك من خلفية علميّة في بعض المجالات كالطب والفلك وغيرها بعد أن إكتسبها من خبرات عائلته، ويملك جو كذلك حساً كوميدي وروحاً مرحة، يملك جو مفتاح الإخلاص في قلادته لما يملكه من إخلاص للآخرين في قلبه.",
      id: "8",
    },
    {
      name: "سمر",
      img: "https://pbs.twimg.com/media/EScj9N6WkAQIQyp?format=png&name=900x900",
      avatarImg:
        "https://images.withthewill.net/adventure2020characterart06_march5_2020.png",
      details:
        "سورا (باليابانية:武之内 空) (بالروماجي:Takenouchi Sora)، المعروفة بالدبلجة العربية بـسمر هي فتاةٌ في الصف الخامس وتبلغُ من العمر إحدى عشر عاماً، تعيشُ سورا مع والدتها في مدينة أودايبا لوحدهما بسبب انشغال والدها في العملِ بعيداً عنها في جامعة كيوتو في مدينة كيوتو وهذا ما جعلها مُرتبطة بوالدتها بشكل أكبر، سورا فتاةٌ عاطفية ولطيفة ومُحبّة للجميع، كما أنها تملك إحساساً عالي بالمسؤولية والخوف على أصدقائها من الأخطار المُحيطة، بالإضافة إلى أنها موثوقة جداً وتحاول الاعتناء بالأطفال الآخرين، كما أن لها دور في كثير من الأحيان أن تكون شخصية كأم لعديد من الأشخاص، تعتني بالآخرين وتحترم بمن هو أكبر مِنها ولا تتردد دائماً في مُساعدة الآخرين، فهي بشهادة جميع أصدقائها ومُعلميها فتاةٌ مُهذبة ولبقة ومُتواضعة ومرّحة في أسلوبها وتعامُلها مع الآخرين، بالرّغم من أنها فتاة فإنها لا تتذمر كثيراً لاسيّما حينما ساءَت الأوضاع في العالم الرقمي فهي لا تأبه للرفاهيّة كسائر الفتيات بل هيّ شديدةُ المواقف وكثيرة الصبر، دائماً ما ترى نفسها بأنها لا تحمل الحُب للجميع على الرغم من أنها كانت عكس ذلك إلى أن تيّقنت معنى الحب وأدركتهُ في نفسها، سورا لا تنجذب إلى ميول الفتيات كالاهتمام بمظهرها وأناقتها، سورا تهوى كرة القدم وتلعب في نفس فريق أمجد في أحد أنديّة كرة القدم، تحمل سورا شارة المحبة في قلادتها حين فهمت معنى المحبة بعد ما حصل لها موقف مع مُرافقتها بيومون هديل) كان قد تكرر مع والدتها سابقاً.",
      id: "7",
    },
  ];

  return (
    <div className="App">
      <BrowserRouter>
        <Navbar bg="light" expand="lg">
          <Container>
            <Navbar.Brand>
              {" "}
              <Link to="/">الصفحة الرئيسية</Link>
            </Navbar.Brand>
            <Navbar.Toggle aria-controls="basic-navbar-nav" />
            <Navbar.Collapse id="basic-navbar-nav">
              <Nav className="me-auto"></Nav>
            </Navbar.Collapse>
          </Container>
        </Navbar>
        <Switch>
          <Route exact path="/">
            <Home data={characters}></Home>
          </Route>
          <Route path="/characters/:id">
            <CharDetails data={characters}></CharDetails>
          </Route>
        </Switch>
      </BrowserRouter>
    </div>
  );
}

export default App;
